zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
  if (!paired_ || !authComplete_) {
    return kIdlePrePairingReportIntervalMs;
  }

  return kIdleConnectedReportIntervalMs;
}

void ClassicBtControllerTransport::sendTaskTrampoline(void *param) {
  auto *transport = static_cast<ClassicBtControllerTransport *>(param);
  while (true) {
    if (!transport->explicitInputActive_) {
      transport->sendCurrentInputReport(false);
    }
    vTaskDelay(pdMS_TO_TICKS(transport->idleSendIntervalMs()));
  }
}

void ClassicBtControllerTransport::reconnectTaskTrampoline(void *param) {
  auto *transport = static_cast<ClassicBtControllerTransport *>(param);
  vTaskDelay(pdMS_TO_TICKS(kLastPeerReconnectDelayMs));

  if (transport->hasPeerAddress_ && !transport->connected_) {
    transport->attemptVirtualCablePlug(transport->lastPeerAddress_, "delayed-last-peer");
  }

  transport->reconnectTaskHandle_ = nullptr;
  vTaskDelete(nullptr);
}

bool ClassicBtControllerTransport::pressButtons(
    uint32_t buttonsMask, uint16_t holdMs, uint16_t settleMs) {
  if (!beginExplicitInput()) {
    return false;
  }
  setButtonBits(buttonsMask);
  updateInputReport();
  bool ok = repeatCurrentInputReport(holdMs, true);
  clearInputs();
  if (!repeatCurrentInputReport(settleMs, true)) {
    ok = false;
  }
  endExplicitInput();
  return ok;
}

bool ClassicBtControllerTransport::moveDirection(
    int x, int y, uint16_t holdMs, uint16_t settleMs) {
  if (!beginExplicitInput()) {
    return false;
  }
  buttonsRight_ = 0;
  buttonsShared_ = 0;
  buttonsLeft_ = 0;
  setLeftStickFromVector(x, y);
  updateInputReport();
  bool ok = repeatCurrentInputReport(holdMs, true);
  clearInputs();
  if (!repeatCurrentInputReport(settleMs, true)) {
    ok = false;
  }
  endExplicitInput();
  return ok;
}

bool ClassicBtControllerTransport::resetConnection(bool reconnectLastPeer) {
  // Let the Switch initiate the HID connection from "Change Grip/Order".
  // Proactive virtual-cable reconnects can race with the host's incoming
  // connection while the ESP32 Bluetooth stack is restarting.
  const bool shouldReconnectLastPeer = reconnectLastPeer && hasPeerAddress_;
  const bool requestedReconnectLastPeer = reconnectLastPeer && hasPeerAddress_;
  Serial.printf(
      "INFO bt reset requested mode=stack-restart reconnect_last_peer=%s requested_last_peer=%s\n",
      boolName(shouldReconnectLastPeer),
      boolName(requestedReconnectLastPeer));

  shutdownClassicBluetooth();

  clearInputs();
  reconnectLastPeerOnRegister_ = shouldReconnectLastPeer;

  if (!initializeClassicBluetooth()) {
    reconnectLastPeerOnRegister_ = false;
    Serial.printf("WARN bt reset restart failed step=%s err=%s\n", initStep_, initError_);
    return false;
  }

  Serial.printf(
      "INFO bt reset completed mode=stack-restart reconnect_last_peer=%s\n",
      boolName(reconnectLastPeerOnRegister_));
  return true;
}

void ClassicBtControllerTransport::enterReconnectableState(const char *reason) {
  connected_ = false;
  readyForReports_ = false;
  authComplete_ = false;
  pairingComplete_ = false;
  paired_ = false;
  discoverable_ = true;
  reportCongested_ = false;
  consecutiveSendReportFailures_ = 0;
  lastDropReason_ = reason;
  clearInputs();

  esp_err_t err = ESP_OK;
  if (gapReady_ && appRegistered_) {
    err = esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
    discoverable_ = err == ESP_OK;
  }

  Serial.printf(
      "INFO bt reconnectable reason=%s discoverable=%s err=%s\n",
      reason,
      boolName(discoverable_),
      esp_err_to_name(err));
}

void ClassicBtControllerTransport::printStatus(Print &output) const {
  output.println("INFO bt_mode=classic-bt-hid");
  output.println("INFO bt_profile=uartswitchcon-pro-controller");
  output.print("INFO bt_stack_started=");
  output.println(boolName(stackStarted_));
  output.print("INFO bt_bluedroid_ready=");
  output.println(boolName(bluedroidReady_));
  output.print("INFO bt_gap_ready=");
  output.println(boolName(gapReady_));
  output.print("INFO bt_hid_ready=");
  output.println(boolName(hidReady_));
  output.print("INFO bt_app_registered=");
  output.println(boolName(appRegistered_));
  output.print("INFO bt_discoverable=");
  output.println(boolName(discoverable_));
  output.print("INFO bt_connected=");
  output.println(boolName(connected_));
  output.print("INFO bt_auth_complete=");
  output.println(boolName(authComplete_));
  output.print("INFO bt_pairing_complete=");
  output.println(boolName(pairingComplete_));
  output.print("INFO bt_paired=");
  output.println(boolName(paired_));
  output.print("INFO bt_ready_for_reports=");
  output.println(boolName(isControllerInputReady()));
  output.print("INFO bt_init_step=");
  output.println(initStep_);
  output.print("INFO bt_init_error=");
  output.println(initError_);
  output.print("INFO bt_last_drop_reason=");
  output.println(lastDropReason_);
  output.print("INFO bt_ignored_report_count=");
  output.println(ignoredReportCount_);
  output.print("INFO bt_intr_report_count=");
  output.println(intrReportCount_);
  output.print("INFO bt_last_intr_report=");
  output.print(lastIntrReportId_);
  output.print("/");
  output.println(lastIntrReportLen_);
  output.print("INFO bt_last_intr_subcmd=");
  output.print(lastIntrSubcommand_);
  output.print("/");
  output.print(lastIntrArg0_);
  output.print("/");
  output.println(lastIntrArg1_);
  output.print("INFO bt_reply_count=");
  output.println(replyCount_);
  output.print("INFO bt_last_reply=");
  output.println(lastReplyLabel_);
  output.print("INFO bt_last_ignored_report=");
  output.print(lastIgnoredReportId_);
  output.print("/");
  output.println(lastIgnoredReportLen_);
  output.print("INFO bt_last_acl_disconnect_reason=");
  output.println(lastAclDisconnectReason_);
  output.print("INFO bt_last_hid_close_status=");
  output.println(lastHidCloseStatus_);
  output.print("INFO bt_last_hid_close_conn_status=");
  output.println(lastHidCloseConnStatus_);
  output.print("INFO bt_send_report_failures=");
  output.println(sendReportFailureCount_);
  output.print("INFO bt_last_send_report_status=");
  output.println(lastSendReportStatus_);
  output.print("INFO bt_last_send_report_reason=");
  output.println(lastSendReportReason_);
  output.print("INFO bt_last_send_report_id=");
  output.println(lastSendReportId_);
  output.print("INFO bt_report_congested=");
  output.println(boolName(reportCongested_));
  output.print("INFO bt_consecutive_send_failures=");
  output.println(consecutiveSendReportFailures_);
  output.print("INFO bt_input_report_submitted=");
  output.println(inputReportSubmitCount_);
  output.print("INFO bt_input_report_completed=");
  output.println(inputReportSendEventCount_);

