zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
  return true;
}

void ClassicBtControllerTransport::resetInputReportTracking() {
  inputReportSubmitCount_ = 0;
  inputReportSendEventCount_ = 0;
  lastInputReportStatus_ = -1;
  lastInputReportReason_ = 0;
  reportCongested_ = false;
  consecutiveSendReportFailures_ = 0;
}

void ClassicBtControllerTransport::rememberPeerAddress(const uint8_t peerAddress[6]) {
  const bool changed = !hasPeerAddress_ ||
                       std::memcmp(lastPeerAddress_, peerAddress, sizeof(lastPeerAddress_)) != 0;
  std::memcpy(lastPeerAddress_, peerAddress, sizeof(lastPeerAddress_));
  hasPeerAddress_ = true;

  if (changed) {
    persistLastPeerAddress(peerAddress);
  }
}

void ClassicBtControllerTransport::persistLastPeerAddress(const uint8_t peerAddress[6]) {
  nvs_handle handle = 0;
  esp_err_t err = nvs_open("storage", NVS_READWRITE, &handle);
  if (err != ESP_OK) {
    Serial.printf("WARN bt persist_peer open failed err=%s\n", esp_err_to_name(err));
    return;
  }

  err = nvs_set_blob(handle, "peer_addr", peerAddress, 6);
  if (err == ESP_OK) {
    err = nvs_commit(handle);
  }
  nvs_close(handle);

  if (err != ESP_OK) {
    Serial.printf("WARN bt persist_peer failed err=%s\n", esp_err_to_name(err));
    return;
  }

  Serial.printf(
      "INFO bt persisted_peer=%s\n",
      formatBluetoothAddress(peerAddress).c_str());
}

void ClassicBtControllerTransport::markControllerPaired() {
  if (!paired_) {
    resetInputReportTracking();
  }
  paired_ = true;
  pairingComplete_ = true;
}

bool ClassicBtControllerTransport::sendSubcommandReply(
    uint8_t reportId, const uint8_t *data, size_t length, const char *label) {
  readyForReports_ = isHidReportChannelOpen();

  if (!readyForReports_) {
    Serial.printf("WARN bt reply skipped reason=not-ready label=%s\n", label);
    return false;
  }

  const esp_err_t err = esp_bt_hid_device_send_report(
      ESP_HIDD_REPORT_TYPE_INTRDATA,
      reportId,
      length,
      const_cast<uint8_t *>(data));
  if (err != ESP_OK) {
    sendReportFailureCount_ += 1;
    lastSendReportStatus_ = static_cast<int>(err);
    lastSendReportReason_ = 0;
    lastSendReportId_ = reportId;
    readyForReports_ = isHidReportChannelOpen();
    Serial.printf(
        "WARN bt reply failed label=%s err=%s fail_count=%lu\n",
        label,
        esp_err_to_name(err),
        static_cast<unsigned long>(sendReportFailureCount_));
    return false;
  }

  replyCount_ += 1;
  lastReplyLabel_ = label;
  Serial.printf("INFO bt reply label=%s report=%u len=%u\n", label, reportId, length);
  return true;
}

bool ClassicBtControllerTransport::attemptVirtualCablePlug(
    const uint8_t peerAddress[6], const char *reason) {
  if (!appRegistered_ || !hidReady_ || connected_) {
    return false;
  }

  const esp_err_t err = esp_bt_hid_device_connect(const_cast<uint8_t *>(peerAddress));
  if (err != ESP_OK) {
    Serial.printf(
        "WARN bt virtual-cable reason=%s err=%s peer=%s\n",
        reason,
        esp_err_to_name(err),
        formatBluetoothAddress(peerAddress).c_str());
    return false;
  }

  Serial.printf(
      "INFO bt virtual-cable reason=%s peer=%s\n",
      reason,
      formatBluetoothAddress(peerAddress).c_str());
  return true;
}

void ClassicBtControllerTransport::scheduleLastPeerReconnect(const char *reason) {
  if (!hasPeerAddress_ || reconnectTaskHandle_ != nullptr) {
    return;
  }

  Serial.printf(
      "INFO bt reconnect scheduled reason=%s peer=%s delay_ms=%u\n",
      reason,
      formatBluetoothAddress(lastPeerAddress_).c_str(),
      kLastPeerReconnectDelayMs);
  xTaskCreatePinnedToCore(
      &ClassicBtControllerTransport::reconnectTaskTrampoline,
      "bt_reconnect_task",
      3072,
      this,
      1,
      &reconnectTaskHandle_,
      0);
}

void ClassicBtControllerTransport::processIncomingReport(uint8_t reportId, uint16_t len, uint8_t *data) {
  if (len < 12 || data == nullptr) {
    const bool repeated = ignoredReportCount_ > 0 && lastIgnoredReportId_ == reportId &&
                          lastIgnoredReportLen_ == len;
    ignoredReportCount_ += 1;
    lastIgnoredReportId_ = reportId;
    lastIgnoredReportLen_ = len;
    if (!repeated || ignoredReportCount_ <= 5 || (ignoredReportCount_ % 20) == 0) {
      Serial.printf(
          "INFO bt intr ignored report=%u len=%u count=%lu data=",
          reportId,
          len,
          static_cast<unsigned long>(ignoredReportCount_));
      if (data == nullptr) {
        Serial.print("null");
      } else {
        const uint16_t loggedLength = len < 16 ? len : 16;
        for (uint16_t index = 0; index < loggedLength; index += 1) {
          Serial.printf("%02X", data[index]);
        }
      }
      Serial.println();
    }
    return;
  }

  intrReportCount_ += 1;
  lastIntrReportId_ = reportId;
  lastIntrReportLen_ = len;
  lastIntrSubcommand_ = data[9];
  lastIntrArg0_ = data[10];
  lastIntrArg1_ = data[11];

  Serial.printf(
      "INFO bt intr report=%u len=%u subcmd=%u arg0=%u arg1=%u\n",
      reportId,
      len,
      data[9],
      data[10],
      data[11]);

  if (data[9] == 2) {
    const uint8_t *btAddress = esp_bt_dev_get_address();
    if (btAddress != nullptr) {
      setReply02BluetoothAddress(btAddress);
      Serial.printf(
          "INFO bt reply02_mac=%02X:%02X:%02X:%02X:%02X:%02X\n",
          btAddress[0],
          btAddress[1],
          btAddress[2],
          btAddress[3],
          btAddress[4],
          btAddress[5]);
    }
    sendSubcommandReply(0x21, kReply02, sizeof(kReply02), "reply02");
    return;
  }
  if (data[9] == 8) {
    sendSubcommandReply(0x21, kReply08, sizeof(kReply08), "reply08");
    return;
  }
  if (data[9] == 16 && data[10] == 0 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress0, sizeof(kReplySpiAddress0), "replyspi0");
    return;
  }
  if (data[9] == 16 && data[10] == 80 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress50, sizeof(kReplySpiAddress50), "replyspi50");
    return;
  }
  if (data[9] == 3) {
    sendSubcommandReply(0x21, kReply03, sizeof(kReply03), "reply03");
    return;
  }
  if (data[9] == 4) {
    sendSubcommandReply(0x21, kReply04, sizeof(kReply04), "reply04");
    return;
  }
  if (data[9] == 16 && data[10] == 128 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress80, sizeof(kReplySpiAddress80), "replyspi80");
    return;
  }
  if (data[9] == 16 && data[10] == 152 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress98, sizeof(kReplySpiAddress98), "replyspi98");
    return;
  }
  if (data[9] == 16 && data[10] == 16 && data[11] == 128) {
    sendSubcommandReply(0x21, kReplySpiAddress10, sizeof(kReplySpiAddress10), "replyspi10");
    return;
  }
  if (data[9] == 16 && data[10] == 61 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress3D, sizeof(kReplySpiAddress3D), "replyspi3d");
    return;
  }
  if (data[9] == 16 && data[10] == 32 && data[11] == 96) {
    sendSubcommandReply(0x21, kReplySpiAddress20, sizeof(kReplySpiAddress20), "replyspi20");
    return;
  }
  if (data[9] == 64) {
    sendSubcommandReply(0x21, kReply4001, sizeof(kReply4001), "reply4001");
    return;
  }
  if (data[9] == 72) {
    sendSubcommandReply(0x21, kReply4801, sizeof(kReply4801), "reply4801");
    return;
  }
  if (data[9] == 34) {
    sendSubcommandReply(0x21, kReply3401, sizeof(kReply3401), "reply3401");
    return;
  }
  if (data[9] == 48) {
    // UARTSwitchCon only treats 0x30 as "paired" for Joy-Con mode. In Pro
    // Controller mode, Switch usually still needs the later 0x21/0x21 NFC/IR
    // MCU step before the controller remains usable outside Change Grip/Order.
    sendSubcommandReply(0x21, kReply3001, sizeof(kReply3001), "reply3001");
    return;
  }
  if (data[9] == 33 && data[10] == 33) {
    markControllerPaired();
    sendSubcommandReply(0x21, kReply3333, sizeof(kReply3333), "reply3333");
    return;
  }
}

void ClassicBtControllerTransport::handleGapEvent(int event, void *rawParam) {
  const auto gapEvent = static_cast<esp_bt_gap_cb_event_t>(event);
  auto *param = reinterpret_cast<esp_bt_gap_cb_param_t *>(rawParam);

